Repository: Pure-Happiness/Logic-Playground
Catalog: Logic Playground/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppTitle
source: Logic Playground
zh_cn: 逻辑游乐场

# addButton.Label
source: New
zh_cn: 新建

# Dark.Content
source: Dark
zh_cn: 深色

# languageBlock.Text
source: Language
zh_cn: 语言

# Light.Content
source: Light
zh_cn: 浅色

source: New Tab
zh_cn: 新建标签页

# openButton.Label
source: Open
zh_cn: 打开

# recentBlock.Text
source: Recent Files
zh_cn: 最近使用的文件

# setButton.Label
source: Settings
zh_cn: 设置

source: Settings
zh_cn: 设置

# settingsTitle.Text
source: Settings (Take effect on the next startup)
zh_cn: 设置（下次启动时生效）

# System.Content
source: Use system setting
zh_cn: 使用系统设置

# themeBlock.Text
source: Theme
zh_cn: 主题

# OpenFilePickerFailure
source: Oops, the file picker failed to start 😵‍💫
zh_cn: 呃呃，无法启动文件选取器😵‍💫

# 文件.Text
source: File
zh_cn: 文件

# 保存.Text
source: Save
zh_cn: 保存

# 另存为.Text
source: Save as
zh_cn: 另存为

# 导入.Content
source: Import
zh_cn: 导入

# 未命名
source: Untitled
zh_cn: 未命名

# 编辑.Text
source: Edit
zh_cn: 编辑

# 撤销.Text
source: Undo
zh_cn: 撤销

# 重做.Text
source: Redo
zh_cn: 重做

# 上一级.Label
source: Parent
zh_cn: 上一级

# OpenFileFailure
source: Oops, cannot open the chosen file 😵‍💫
zh_cn: 呃呃，无法打开指定的文件😵‍💫

# 确认按钮.Content
source: Confirm
zh_cn: 确认

source: Go to definition
zh_cn: 转到定义

source: Open here
zh_cn: 在此处打开

source: Open in new tab
zh_cn: 在新标签页中打开

# 非类型名称
source: does not name a type.
zh_cn: 非类型名称。

# 错误消息.Text
source: Error Message:
zh_cn: 错误消息：

# 错误位置.Text
source: Error position:
zh_cn: 错误位置：

# 类型符号错误
source: Types should occur on both sides of a type operator.
zh_cn: 类型运算符两侧必须有类型。

# 类型连接错误
source: Two types should be connected with an operator.
zh_cn: 两个类型必须通过运算符连接。

# 缺少左括号
source: The brackets do not match (left bracket missing).
zh_cn: 括号不匹配（缺少左括号）。

# 缺少右括号
source: The brackets do not match (right bracket missing).
zh_cn: 括号不匹配（缺少右括号）。

# Open.Text
source: Open
zh_cn: 打开

# Remove.Text
source: Remove Item
zh_cn: 移除此项

source: Remove Item
zh_cn: 移除此项

# Recovery.Header
source: Recover unsaved files
zh_cn: 恢复未保存的文件

# 别名.Content
source: Aliases
zh_cn: 别名

# 函数和模板.Content
source: Functions & Templates
zh_cn: 函数和模板

# 等于.Content
source: Equalities
zh_cn: 等于

# 选择.Content
source: Choices
zh_cn: 选择

# 全称量词.Content
source: Universal Quantifications
zh_cn: 全称量词

# 范围.Content
source: Scopes
zh_cn: 范围

# 物体.Content
source: Object
zh_cn: 物体

# 类型.Content
source: Type
zh_cn: 类型

# 非物体名称
source: does not name an object.
zh_cn: 非物体名称。

# 物体符号错误
source: Objects should occur on both sides of an object operator except "!".
zh_cn: 非“!”的物体运算符两侧必须有物体。

# 物体连接错误
source: Two objects should be connected with an operator.
zh_cn: 两个物体必须通过运算符连接。

# 全称量词错误
source: Invalid operand for "!".
zh_cn: “!”的操作数不合要求。

# 函数模板错误
source: Invalid operand for "#".
zh_cn: “#”的操作数不合要求。

# 等于错误
source: Operands of "=" are of different types.
zh_cn: “=”的操作数类型不相同。

# 选择错误
source: The first operand of "?" should be of type "bool".
zh_cn: “?”的第一运算数类型应为“bool”。

# 选项错误
source: The second and third operand of "?" should be of the same type.
zh_cn: “?”的第二、三操作数类型应相同。

# 已声明为物体
source: has been declared as an object.
zh_cn: 已声明为物体。

# 此处不应有类型
source: Unexpected type.
zh_cn: 此处不应有类型。

# 此处不应有物体
source: Unexpected object.
zh_cn: 此处不应有物体。

# 此处不应有参数
source: Unexpected parameter.
zh_cn: 此处不应有参数。

# 函数错误
source: The argument's type does not match the function.
zh_cn: 函数实参类型不匹配形参。

# 已声明为类型
source: has been declared as a type.
zh_cn: 已声明为类型。

# 函数定义错误
source: Invalid Operand for "@".
zh_cn: “@”的操作数不合要求。

# 此处应有参数
source: Expect a parameter.
zh_cn: 此处应有参数。

# “:”前不应是表达式
source: An expression should not occur on the left of ":".
zh_cn: “:”前不应是表达式。

# 三元运算符“?”要有三元
source: Ternary operator "?" needs three operands.
zh_cn: 三元运算符“?”要有三元。

# 复制.Content
source: Copy Theorem
zh_cn: 复制定理

# 无法写入文件
source: Failed to write into the file.
zh_cn: 无法写入文件

# 文件读取错误
source: The file contains errors; the software only read data up to the point before the first error occurred.
zh_cn: 文件中存在错误，只读取到错误首次出现的位置之前。

# 读取文件失败
source: Failed to read the file.
zh_cn: 读取文件失败

# ReplaceFailure
source: Failed to replace the original file.
zh_cn: 替换原文件失败

# OpenOriginalFailure
source: Failed to open the original file.
zh_cn: 打开文件失败

# OpenSaveFailure
source: Failed to open the file for recovery.
zh_cn: 无法打开用于恢复的文件

# 是否保存
source: Save your work?
zh_cn: 是否保存？

# 是
source: Save
zh_cn: 保存

# 否
source: Discard
zh_cn: 丢弃

# 取消
source: Cancel
zh_cn: 取消

# MoreInformation.Text
source: For more information, please refer to the documents.
zh_cn: 更多信息见文档。

# 函数.Content
source: Function
zh_cn: 函数

# 模板.Content
source: Template
zh_cn: 模板

source: Copy
zh_cn: 复制

# 依据不合要求
source: The basis do not meet the requirements
zh_cn: 依据不合要求

# 非焦点
source: It is forbidden to operate in a scope that is not focused on.
zh_cn: 禁止在非焦点范围执行操作。

# 普通范围.Content
source: Regular Scope
zh_cn: 普通范围

# 假设.Content
source: Assume
zh_cn: 假设

# 任意物体.Content
source: Arbitrary Object
zh_cn: 任意物体

# 任意类型.Content
source: Arbitrary Type
zh_cn: 任意类型

# 导出.Content
source: Export
zh_cn: 导出

# 选择文件.Content
source: Select files
zh_cn: 选择文件

# NotATheorem
source: cannot be viewed as a theorem.
zh_cn: 不可视作定理。

# 离开.Content
source: Exit
zh_cn: 离开

# 无母
source: The current scope does not have its parent scope.
zh_cn: 当前范围无母范围。

# 导航到上一级
source: Navigate to parent
zh_cn: 导航到上一级

# 导航到
source: Navigate to
zh_cn: 导航到

# 未知错误
source: An unknown error has occurred.
zh_cn: 出现未知错误。

# 冲突
source: Name collision.
zh_cn: 名称冲突。
